<a href="https://colab.research.google.com/github/mukami2024/inspire_stem/blob/main/trial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

installing sql

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.4 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [ ]:
%load_ext sql

In [ ]:
%%sql sqlite:///chinook.db

In [ ]:
%%sql CREATE TABLE Worker(
    name VARCHAR(25),
    salary INT,
    weights DECIMAL(5,2)


);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql INSERT INTO Worker VALUES
( "Sammy", "240000" , "60.2")
( "Kelsy" , "340000" , "58.9");

 * sqlite:///chinook.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: INSERT INTO Worker VALUES
( "Sammy", "240000" , "60.2")
( "Kelsy" , "340000" , "58.9");]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql INSERT INTO Worker VALUES
( "Joshua", "230000" , "54.3")

 * sqlite:///chinook.db
1 rows affected.

[]

In [ ]:
%%sql SELECT * FROM Worker;

 * sqlite:///chinook.db
Done.

[('Sammy', 240000, 60.2), ('Sammy', 240000, 60.2), ('Joshua', 230000, 54.3)]